IDEA Open Model
Loading Constructor (LoadingType, Int32)
Compatible with IDEA StatiCa 20.1
 Constructor
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public Loading(
	LoadingType loadingType,
	int id
)
Public Sub New (
	loadingType As LoadingType,
	id As Integer
)
Parameters
loadingType
Type: IdeaRS.OpenModel.Result.LoadingType
Type of loading
id
Type: System.Int32
Id of loading
See Also
Reference
Loading Class
Loading Overload
IdeaRS.OpenModel.Result Namespace